---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.SegmentDrawnFromWrongSideWarning
source: html/26603f29-5650-1dd7-be31-7596af2ad296.htm
---
# Autodesk.Revit.DB.BuiltInFailures.AutoRouteFailures.SegmentDrawnFromWrongSideWarning Property

The segment is being drawn from the wrong side to connect to the location you indicated.

## Syntax (C#)
```csharp
public static FailureDefinitionId SegmentDrawnFromWrongSideWarning { get; }
```